calm water resistance/KVLCC2/Fr0.1423/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.057167755415733 0 -7.031970721645971)
	(16.5857516331236 0 -7.031970721645971)
	(16.5857516331236 8.00189771773507 -7.031970721645971)
	(-11.057167755415733 8.00189771773507 -7.031970721645971)
	(-11.057167755415733 0 2.9097809882672983)
	(16.5857516331236 0 2.9097809882672983)
	(16.5857516331236 8.00189771773507 2.9097809882672983)
	(-11.057167755415733 8.00189771773507 2.9097809882672983)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (114 33 41) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

