calm water resistance/KVLCC2/Fr0.1423/0.org/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      alpha.water;
}

#include      "include/initialConditions";

dimensions    [0 0 0 0 0 0 0];

internalField uniform 0;

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedValue;
		value	$internalField;
	}


	sides
	{
		type	slip;
	}


	outlet
	{
		type	variableHeightFlowRate;
		lowerBound	0;
		upperBound	1;
		value	$internalField;
	}


	midPlane
	{
		type	symmetryPlane;
	}


	top
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}


	hull
	{
		type	zeroGradient;
	}


	deck
	{
		type	zeroGradient;
	}


	rudder
	{
		type	zeroGradient;
	}

}
