calm water resistance/KVLCC2/Fr0.1423/0.org/include/initialConditions
flowVelocity          (1.046884 0 0);
Umean                  1.046884;
turbulentKE            1.643951e-04;
turbulentOmega         9.487462e-01;
turbulentEpsilon       9.358152e-08;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;